[
  {
    "path": "events/2025-03-20-Ep-6-Research_Software_Funding/",
    "title": "Episode 6: Research Software Funding",
    "description": "The sixth episode of the series \"Enabling Open Science Through Research Code\" jointly organised by [RSE Asia Association](https://rse-asia.github.io/RSE_Asia/) and [RSSE Africa](https://rsse.africa).",
    "author": [],
    "date": "2025-03-14",
    "categories": [
      "Research Software Engineering",
      "Open Science",
      "Coding",
      "Funding"
    ],
    "contents": "\n“Colorful programming php and html code on a monitor” by Cronislaw.\nIn the last episode of the series on ‘Enabling Open Science through Research Code’, we will explore opportunities related to funding for research software-related work.\n20 March 2025 @ 8:30 - 10:00 am UTC (see in your local time)\nRegister now\nOur Speakers\nCarlos Martinez-Ortiz,\nScientific Community Manager, Netherlands eScience Center\nCarlos is a Community Manager at the Netherlands eScience Center. His work focuses on topics related to software sustainability at the eScience Center, advancing its goal to empower researchers by collaboratively designing sustainable software, and building digital skills and expertise.\nColette Bos,\nProgramme Director Netherlands eScience Center\nColette holds a PhD in research policy/research sociology and has extensive experience in research policy, research funding, impact of science evaluations and open science. She has worked at the Netherlands eScience Center for two years as Programme Director where she is responsible for the project portfolio of the center.\nGemma Turon Rodrigo, Executive Director, Ersilia Open Source Initiative\nTrained as a molecular biologist, Gemma completed a PhD in colorectal cancer and stem cells at IRB Barcelona in 2019, before taking a one-year break to focus on working and volunteering in the third sector. This shifted her scientific interest to global health and neglected diseases, and the existing barriers to tackle some of the most urgent health issues in developing countries. With Ersilia, she aims to explore new ways of community building and engagement in the scientific arena, at the intersection between academia, biotech start-ups and NPOs.\nJohn Chevers, Technology Lead, Data for Science and Health, Wellcome Trust\nJohn Chevers is Technology Lead in the Data for Science and Health Team at the Wellcome Trust. He has held leadership roles in industry, the NHS and academia, and has a particular interest in the funding and sustainability of software and data resources. Prior to working in the health sector, John led partnerships and commercial strategy for GEANT, the pan-European internet for research and education. He holds a PhD in Physics and an MSc in electrical engineering.\nJoseph Wafula, Professor and Lead, African Open Science Platform East Africa Node\nStay Connected\nFollow our LinkedIn page to get the latest updates about this series.\n\n\n\n",
    "preview": "events/2025-03-20-Ep-6-Research_Software_Funding/software_funding.jpg",
    "last_modified": "2025-09-01T22:25:46+01:00",
    "input_file": {}
  },
  {
    "path": "events/2025-02-20_Ep-5-Testing_Research_Code/",
    "title": "Episode 5: Testing Research Code",
    "description": "The fifth episode of the series \"Enabling Open Science Through Research Code\" jointly organised by [RSE Asia Association](https://rse-asia.github.io/RSE_Asia/) and [RSSE Africa](https://rsse.africa).",
    "author": [],
    "date": "2025-02-03",
    "categories": [
      "Research Software Engineering",
      "Open Science",
      "Coding"
    ],
    "contents": "\n“A computer screen with a bunch of code” by Artturi Jalli is licensed as free to use under the Unsplash License.\nHave you ever written tests for your research code?\nIn this episode we’ll explore why research code should include tests, what the purpose of tests are, different types of tests and how to design them, where to start with testing and finally how to automate testing.\n20 February 2025 @ 8:30 - 10:00 am UTC (see in your local time)\nRegister now\nOur Speakers\nAbhishek Dasgupta,\nSenior Research Software Engineer, Oxford Research Software Engineering Group, University of Oxford\n“I am a Research Software Engineer with the University of Oxford RSE group, interested in software development productivity, best practices, and reproducibility of research software through training and outreach. I am particularly interested in improving code testing, and improving productivity through the use of type checkers, linters and through deeper knowledge of the ecosystem of tools that are available to improve research software. Prior to my current role as a research software engineer, I did my DPhil in Computer Science, before moving to a postdoctoral position in the Department of Politics and International Relations at Oxford.”\nEmail: abhishek dot dasgupta @ dtc dot ox do ac dot uk\nSaranjeet Kaur Bhogal,\nResearch Software Engineer, Imperial College London\nSaranjeet Kaur Bhogal is a Research Software Engineer at Imperial College London. In 2023, she was selected an International Fellow of the Software Sustainability Institute. Her academic background includes an MPhil in Statistics. Throughout her career, she has been involved with various software engineering communities. In 2021, she participated in the Open Life Science program, where she co-founded the Research Software Engineering (RSE) Asia Association. She has represented the RSE Asia community at events in Bhutan, Nepal, Sri Lanka, and the UK.\nEmail: kaur dot saranjeet3 @ gmail dot com\nSheena O’Connell, Founder, Prelude\n“I’m a software engineer and technical leader who has spent the last 5+ years reimagining how we teach coding. I’ve built alternative education systems, focusing on effective teaching practices and organizational structures. I founded the Guild of Educators to support tech educators and recently founded Prelude, offering technical training and consulting for educators and organizations. I’m active in the global Python and Django communities, organizing events like PyCon Africa and DjangoCon Africa. I’m a Django Software Foundation member and the co-chair of the Python Software Foundation’s Education and Outreach workgroup.”\nEmail: sheena @ prelude dot tech\nStay Connected\nFollow our LinkedIn page to get the latest updates about this series.\n\n\n\n",
    "preview": "events/2025-02-20_Ep-5-Testing_Research_Code/testing_research_code.jpg",
    "last_modified": "2025-09-01T22:25:46+01:00",
    "input_file": {}
  },
  {
    "path": "events/2025-01-23_Ep-4-Documentation_For_Research_Code/",
    "title": "Episode 4: Documentation for Research Code",
    "description": "The forth episode of the series \"Enabling Open Science Through Research Code\" jointly organised by [RSE Asia Association](https://rse-asia.github.io/RSE_Asia/) and [RSSE Africa](https://rsse.africa).",
    "author": [],
    "date": "2024-12-31",
    "categories": [
      "Research Software Engineering",
      "Open Science",
      "Coding"
    ],
    "contents": "\n“A computer screen with a bunch of code” by Chris Ried is licensed as free to use under the Unsplash License.\nDo you dread writing documentation for the code you develop as part of your research projects?\nThis episode we will focus on the motivation for creating documentation for research code, different types of documentation, some small additions that can already make a world of difference to the usability of your code (for yourself and others!) for example, in-code comments and README files. We’ll also look at some more advanced documentation options.\n23 January 2025 @ 8:30 - 10:00 am UTC (see in your local time)\nRegister now\nOur Speakers\nJenny Wong (she/her),\nTechnical Content Developer, 2i2c (US-based organisation)\nJenny is a Technical Content Developer at 2i2c, a US-based non-profit that provides a global network of interactive computing platforms for research and education communities. She primarily supports folks with getting the most out of cloud-native workflows through documentation, training and community engagement. She is passionate about democratising access to large-scale, scientific cyber-infrastructure and loves using her deep technical knowledge and friendly communication skills to bridge together technology and people.\nEmail: jwong @ 2i2c dot org\nJoel Nitta,\nAssociate Professor, Chiba University, Japan\nI am an evolutionary biologist with a focus on fern ecology and evolution at Chiba University, Japan. I use, create, and teach tools to enable open, reproducible science. My programming language of choice is R. I obtained my BA from UC Berkeley, MS from the University of Tokyo, and PhD from Harvard University. I am a certified instructor for The Carpentries and am active in communities of practice including ROpenSci, The Carpentries, and RSE Asia.\nEmail: joelnitta @ gmail dot com\nMthetho Vuyo Sovara,\nResearch Support Scientist, DCentre for High Performance Computing (CHPC), National Integrated Cyberinfrastructure System (NICIS), South Africa\nI am passionate about understanding ocean-atmosphere interactions in southern Africa. My research leverages advanced research software, computational models, and data science techniques powered by high-performance computing (HPC) to improve weather and climate forecasts, supporting climate policy and tackling environmental challenges. Additionally, I work to empower postgraduate students across southern Africa through training in coding, research software, and HPC optimization. My initiatives span from high school outreach programs to advanced university workshops, fostering technical expertise and innovation in climate and computational research. These efforts aim to build capacity and advance scientific understanding in the region.\nEmail: mvsovara @ gmail dot com | mvsovara @ gmail dot com\nStay Connected\nFollow our LinkedIn page to get the latest updates about this series.\n\n\n\n",
    "preview": "events/2025-01-23_Ep-4-Documentation_For_Research_Code/Documentation_for_research_code.jpg",
    "last_modified": "2025-09-01T22:25:46+01:00",
    "input_file": {}
  },
  {
    "path": "events/2024-12-12_Ep-3-Open-Research-Code/",
    "title": "Episode 3: Opening Up Research Code",
    "description": "The third episode of the series \"Enabling Open Science Through Research Code\" jointly organised by [RSE Asia Association](https://rse-asia.github.io/RSE_Asia/) and [RSSE Africa](https://rsse.africa).",
    "author": [],
    "date": "2024-11-23",
    "categories": [
      "Research Software Engineering",
      "Open Science",
      "Coding"
    ],
    "contents": "\n“Fund-raising and self-publishing (the open source way), Part one” by opensourceway is licensed under CC BY-SA 2.0.\nAre you ready to get some credit for the coding you’ve been doing as part of your research?\nThis episode will focus on ways to make your code contribute to your resumé. We will look at how you can share your code with the world (including various software licensing options), get persistent identifiers and make your code citable, and even how you can publish your code as an article!\n12 December 2024 @ 8:30 - 10:00 am UTC see in your local time\nRegister now\nOur Speakers\nAdeyinka Oresanya,\nSoftware Developer, Community Health Analytics in Open Source Software (CHAOSS)\nAdeyinka Oresanya is a multidisciplinary software developer and open-source maintainer\nwith a strong foundation in research. She holds a PhD in Agricultural Extension and Rural\nDevelopment, combining a unique blend of academic rigour and practical software\nengineering skills to lead impactful projects. As the Badging Lead for the DEI Event\nBadging Program at CHAOSS, she plays a key role in advancing diversity, equity, and\ninclusion within open-source communities and events. Adeyinka also leads the CHAOSS Africa\nDevelopers’ Focus Group, where she drives initiatives aimed at fostering the growth of\nopen-source developer communities across Africa.\nChioma Onyido,\nBioinformatics Engineer, Bioconductor & Covenant University\nChioma is a seasoned biocurator and bioinformatician with a background in biochemistry, who transitioned into Bioinformatics to explore how computational tools and data science can solve real-world health challenges. Her work spans using Bioconductor and open-source tools to analyze complex biological datasets and develop predictive models, aiming to improve disease risk prediction for underrepresented populations. She enjoys making research more accessible by creating well-documented, reproducible code and sharing bioinformatics resources with the community.\nEmail: chiomabonyido @ gmail dot com\nDr Kate Huddlestone,\nSenior Lecturer, Department of General Linguistics, Stellenbosch University, South Africa\nI am a senior lecturer in the Department of General Linguistics at Stellenbosch University, the managing editor for Stellenbosch Papers in Linguistics Plus (SPiL Plus) and deputy chairperson for the Southern African Linguistics and Applied Linguistics Society (SALALS). My research focuses primarily on South African Sign Language (SASL) but I also work on aspects of the syntax and pragmatics of Afrikaans and South African English. I use ELAN to annotate SASL data collected from deaf signers. I use R to analyse the effect of linguistic and sociolinguistic variables on lexical variation, language structure and language use.\nEmail: katevg @ sun dot ac dot za\nJuan Pablo Flores,\nSenior Program Manager, GitHub\nJuan Pablo Flores is a Program Manager at GitHub, where he supports the creation of\nopportunities for people from diverse backgrounds to learn programming and fosters connections among different technical communities. He has worked on research in Human-Computer Interaction (HCI), focusing on how individuals collaborate on online platforms, and has explored the social dynamics of live streaming. His recent work includes advancing Open Science initiatives and measuring the impact of artificial intelligence in education, with the goal of leveraging technology for more inclusive and effective learning environments.\nEmail: juanpflores @ github dot com\nMars Lee,\nTechnical Illustrator, NumPy & Open Source Design\nMars Lee is a Technical Illustrator that makes byte-sized comics that explain technical topics! She uses art, an under-represented skillset in open source, to get scientists contributing. From contributing back to libraries they use, she hopes scientists share their own research code and software. She is active in the Scientific Python space, with contributions to NumPy, JupyterLab, scikit-learn and more. Her most recent works are the ‘How to Contribute to NumPy’ comics - https://heyzine.com/flip-book/3e66a13901.html\nX: https://x.com/marsbarlee\nEducational Resources\nA useful open educational resource related to these topics are available from CodeRefinery.\nFollow the CodeRefinery lesson on Social Coding and Open Software\nStay Connected\nFollow our LinkedIn page to get the latest updates about this series\n\n\n\n",
    "preview": "events/2024-12-12_Ep-3-Open-Research-Code/publishing_CC.png",
    "last_modified": "2025-09-01T22:25:46+01:00",
    "input_file": {},
    "preview_width": 520,
    "preview_height": 292
  },
  {
    "path": "events/2024-11-14_Ep-2-Reproducibility/",
    "title": "Episode 2: Enabling Reproducibility through Research Code",
    "description": "The second episode of the series \"Enabling Open Science Through Research Code\" jointly organised by [RSE Asia Association](https://rse-asia.github.io/RSE_Asia/) and [RSSE Africa](https://rsse.africa).",
    "author": [],
    "date": "2024-10-22",
    "categories": [
      "Research Software Engineering",
      "Open Science",
      "Coding"
    ],
    "contents": "\n“Current Setup” by Yutaka Tsutano is licensed under CC BY 2.0.\nDo you spend a lot of time using programming to analyse your data, develop workflows, build models or create visualisations?\nThis episode focused on steps to take, to ensure your code enables reproducibility in your research project. We explored a variety of topics ranging from easily implementable, small changes that can make a huge difference (such as having a good directory structure), to more complex practices like the use of containers to manage versions and dependencies.\n14 November 2024 @ 8:30 - 10:00 am UTC see in your local time\nOur Speakers\nKozo Nishida,\nProject Researcher, Tokyo University of Agriculture and Technology\nI worked as a technical staff member at RIKEN for 11 years, during which I became familiar with research software communities such as PyData and Bioconductor, and released several research software packages. I am interested in contributing to the open science community.\nPeter van Heusden,\nBioinformatician, South African National Bioinformatics Institute / University of the Western Cape\nI am a bioinformatician with a computer science and computer systems infrastructure background. My focus at SANBI is building tools to enhance genomic surveillance of some of the world’s most deadly pathogens (such as M. tuberculosis). I do so by focusing on translating bioinformatics from research to accessible, reproducible workflows applicable to public health needs.\nRadovan Bast,\nResearch Software Engineer, UiT- University of Tromsø / CodeRefinery\nRadovan Bast is a research software engineer with a background in theoretical chemistry. He has previously worked in France and Sweden, and he is currently based in Norway. Radovan’s work is at the border between science, software, and computational support, and he enjoys supporting multi-disciplinary research. Radovan now works as part of the Norwegian Research Infrastructure Services at the University of Tromsø (UiT), Norway, and leads the CodeRefinery project. At UiT he leads the high-performance computing group and the research software engineering group. His goal is to make computing and programming more accessible and usable through training.\nEmail: radovan.bast @ uit dot no\nEducational Resources\nA useful open educational resource related to these topics are available from CodeRefinery.\nFollow the CodeRefinery lesson on Reproducible research\nMeetup Resources\nView our Recording:\n\nAccess our Resources Sheet\nBlog post - coming soon\nStay Connected\nFollow our LinkedIn page to get the latest updates about this series\n\n\n\n",
    "preview": "events/2024-11-14_Ep-2-Reproducibility/current_setup.jpg",
    "last_modified": "2025-09-01T22:25:46+01:00",
    "input_file": {}
  },
  {
    "path": "events/2023-10-26-Community_Call_Pieter_van_der_Hijden/",
    "title": "The Quest for the Data Workbench",
    "description": "RSE Asia Community Call: Guest - Pieter van der Hijden.",
    "author": [],
    "date": "2023-10-26",
    "categories": [
      "Research Software Engineering",
      "Alt-text",
      "Accessibility",
      "Illustration"
    ],
    "contents": "\nCommunity call: Guest - Pieter van der Hijden\nPieter van der Hijden is an international management consultant specializing in “ICT for Sustainable Development Goals (SDGs).” His expertise lies in gaming and simulation, digital making (including fab labs and STEM learning), and e-learning (distance learning, Moodle). Pieter is based in Amsterdam, The Netherlands, and operates from his own consultancy, Sofos Consultancy. He has set up two fab labs in Suriname and does volunteer work in the global fab lab network, especially around Fablabs & SDGs.\nDuring this Community Call, Pieter will share his insights on “The Quest for the Data Workbench: How to bridge the gap between the Sustainable Development Goals (SDGs) and the Fablab/Maker Movement?”\nMore information\nLearn more about Pieter van der Hijden on his LinkedIn profile: Pieter van der Hijden\nExplore the Fab Foundation: Fab Foundation\nWhen: Thursday, 26th October 2023, 8:00 AM - 9:00 AM UTC\nWhere: Online\n\n\n\n",
    "preview": {},
    "last_modified": "2025-09-02T14:18:51+01:00",
    "input_file": "community_call_pieter.knit.md"
  },
  {
    "path": "events/2022-07-08-Alt_Text_SPEC/",
    "title": "Writing alt-text for scientific diagrams",
    "description": "In this event, we will discuss how to write effective alt-text for scientific diagrams. We will cover best practices, common pitfalls, and tools that can help you create accessible content.",
    "author": [],
    "date": "2022-07-08",
    "categories": [
      "Research Software Engineering",
      "Alt-text",
      "Accessibility",
      "Illustration"
    ],
    "contents": "\nWorkshop hosts:\nMars Lee is a technical illustrator who contributes to data science software and open-source Python projects such as NumPy. She grew up in Singapore and rollerskates. 🛼\nIsabela Presedo-Floyd (she/her) is a UX/UI designer in theory and professional question-asker in practice. She helps build open-source scientific software with an emphasis on improving the accessibility of communities and their tools.\nWhen: Friday, 8th July 2022, 13:00 UTC\nWhere: Online\n\n\n\n",
    "preview": "events/2022-07-08-Alt_Text_SPEC/Alt-Text_Workshop_RSE_Asian_and_SPEC.png",
    "last_modified": "2025-09-02T13:55:42+01:00",
    "input_file": "alt_text_spec.knit.md",
    "preview_width": 1080,
    "preview_height": 1080
  },
  {
    "path": "events/2022-05-01_RSEAA22/",
    "title": "RSE Asia Australia Unconference 2022 (RSEAA22)",
    "description": "The first RSE Asia Australia Unconference.",
    "author": [],
    "date": "2022-05-01",
    "categories": [
      "Research Software Engineering",
      "Community Building"
    ],
    "contents": "\nBanner of RSE Asia Australia conference 2022 - building the research software community across Asia and Australia.\nWe invite you to join us for the first online Research Software Engineer (RSE) Asia Australia Unconference from the 14th to the 16th of September 2022. This is a joint partnership between the newly formed RSE Asia Association and the RSE Association of Australia and New Zealand.\nWe would like to thank our Key partners ARDC and QCIF for supporting us, as well as our Accessibility partner, the Society for Research Software Engineering, and our Allied partners, NCI Australia and Google Cloud for researchers.\nA copy of our report is available at “Mosbergen, Rowland (2022): Research Software Engineer Asia Australia Unconference Summary Report. figshare. Online resource. https://doi.org/10.6084/m9.figshare.21201989”. This includes an accessible report in Microsoft Word format.\nCheck the video playlist with our keynotes and panel discussion https://tinyurl.com/RSEAA2022-videos.\n\n\nWhat is a Research Software Engineer?\nResearch Software Engineer is a broad term for people who combine programming and research skills that have trouble defining their role and value within academia. e.g researchers and academics who code, generalists who bring communities together across the research and technical domains, systems administrators who maintain research systems, and software engineers who work in the research domain.\nWhy participate?\nThis will be run as a participant-first online unconference to ensure you have a say on how we develop the community and to allow you to share your valuable technical and social knowledge of research software with the community. In line with that, the theme for this year’s unconference is “Building community”.\nTogether, we can create a sustainable community that benefits research software engineers by raising recognition and building career paths for RSEs, and ultimately contributes to more efficient and reproducible research.\nWe also hope that this experience will identify ways to positively engage with senior leaders who are working on policies that directly affect you and the rest of the RSE community.\nRegister here (This registration is closed now.)\nWhat is an unconference?\nThe unconference will run online over three half-days from 13:00 to 17:00 AEST on 14, 15 and 16 of September. An unconference is where the agenda is created by the attendees at the beginning of the meeting. Anyone who wants to initiate a discussion on a topic can claim a time and a space [1].\nFor this particular unconference, we will create breakout groups for the top three topics for each session. At the start of each day we will have an introduction session to provide the participants with some ideas on what they might want to discuss during the conference. We aim to summarise topics and make these available publicly after the unconference.\nAn overview of what the program will look like is below.\nhttps://en.wikipedia.org/wiki/Unconference\nDraft Programme\nAll times in UTC+10\n\nDay 1 - 14th September\nDay 2 - 15th September\nDay 3 - 16th September\n1:00PM - 1:30PM\nWelcome, Vision, Explanation, and Partners\nExplain, Review\nExplain, Review\n1:30PM - 2:00PM\nEarly Career RSE keynote\nMid Career RSE keynote\nStrategy & Policy Panel\n2:00PM - 2:30PM\nIntroductions to connect\nSecond Session\nStrategy & Policy Panel\n2:30PM - 3:00PM\nIntroductions to connect\nSecond Session\nStrategy & Policy Panel\n3:00PM - 3:30PM\nBreak\nBreak\nBreak\n3:30PM - 4:00PM\nFirst Session\nThird Session\nActionable items\n4:00PM - 4:30PM\nFirst Session\nThird Session\nActionable items\n4:30PM - 5:00PM\nEarly Career RSE keynote\nReview and discussion\nClose and thank you\nFlyers\nPanel RSE Asia Australia conference 2022 - building the research software community across Asia and AustraliaKeynotes of RSE Asia Australia conference 2022 - building the research software community across Asia and AustraliaKey Dates\nSAVE the dates! 14th to the 16th of September 2022 13:00 to 17:00 AEST\nMonday 27th June 2022: Registration opens\nMonday 15th August 2022: Deadline for accessibility grants\nWednesday 31st August 2022: Deadline for applying to scholarship\nWednesday 7th September 2022: Registration closes\nTuesday 13th September 2022: Optional Local Hub meetups in person\nWednesday 14th September 2022: Start of unconference, Junior RSE Keynote\nThursday 15th September 2022: Senior RSE Keynote\nFriday 16th September 2022: End of unconference, RSE Strategy Policy Panel\nAll dates combined to an .ics file for your Calendar App: RSEAA2022.ics\nRegistration\nRegistration is now open here.\nRegistration will close on the 7th of September 2022.\nAccessibility and Inclusivity\nWe are committed to creating a safe, accessible, and inclusive environment for all participants.\nTo this end we are offering 50 scholarships for staff or students to participate for free, as well as a $50 AUD accessibility micro-grant to help with internet, headphones, childcare etc.\nEligibility for the scholarships will be based on prioritising and maximising the inclusion and participation of people who have been impacted due to the cumulative effects of discrimination on factors such as race, gender, disability, gender identity, financial status,and the intersectionality of that discrimination as well as others not mentioned here.\nEligibility for the accessibility micro-grants will be based on a similar approach.\nLiz Hare has provided a high-level accessibility report for the conference.\nHow to apply for the scholarship and accessibility micro-grant\nTo apply for the scholarship, please email us at rse2022 at rse-aunz dot org with the subject [Scholarship] and why you would like to attend for free and how this would benefit you and your organisation (200 words maximum).\nTo apply for the accessibility micro-grant, please email us at rse2022 at rse-aunz dot org with the subject [Accessibility] and why you would like a micro-grant, how would you use it and how attending would benefit you (200 words maximum).\nIf you are applying for both, please email us separately.\nWe encourage participants to apply even if they do not think they are eligible as this will allow us to prioritise and maximise diversity and inclusion. All information will be treated in a confidential manner.\nIf you feel that the unconference is not matching up to the commitment of these ideals, please let us know by contacting the organising committee at rse2022 at rse-aunz dot org.\nThe Code of Conduct is designed to provide all participants with community participation guidelines.\nPartner with us\nIf your organisation would like to partner with us, there are still Allied partnerships available. To see how that would benefit your organisation, please see the Unconference Partner Prospectus.\nContact Us\nIf you would like to know more or have any questions, please contact the organising committee at rse2022 at rse-aunz dot org by email.\nAligned Conferences & Events\nSeptember is full of RSE conferences around the world!\nSeptember 6-8, RSECon2022 is in person at Newcastle University in the UK\nSeptember 12-13, NZRSE 2022 online\nSeptember 13, possible in person meetings for RSEs in Australia and New Zealand main cities (see details in the registrations)\nSeptember 14-16, RSE Asia Australia Unconference 2022 Online\nDownload Flyer\nThe flyer can be downloaded here.\nHere is the suggested text to complement the flyer:\nFor those who are interested, we invite you to the first online Research Software Engineer (RSE) Asia Australia Unconference from the 14th to the 16th of September 2022. This is a joint partnership between the newly formed RSE Asia Association and the RSE Association of Australia and New Zealand. We have made the costs low ($10 to $20 AUD) to attract a broader audience, and there are 50 scholarships available, as well as a $50 AUD accessibility micro-grant. Details here: https://rse-aunz.github.io/2022-Asia-Australia-unconference/\nKey Partners\nlogo of QCIFlogo of ARDCAccessibility Partner\nlogo of Society of RSEAllied Partner\nlogo of NCIlogo of Google\n\n\n",
    "preview": "events/2022-05-01_RSEAA22/RSEAA22_banner.png",
    "last_modified": "2025-09-01T22:25:46+01:00",
    "input_file": {},
    "preview_width": 944,
    "preview_height": 180
  }
]
