[
  {
    "path": "events/2024-12-12_Ep-3-Open-Research-Code/",
    "title": "Episode 3: Opening Up Research Code",
    "description": "The third episode of the series \"Enabling Open Science Through Research Code\" jointly organised by RSE Asia Association and RSSE Africa.",
    "author": [
      {
        "name": "Jyoti Bhogal",
        "url": "https://github.com/jyoti-bhogal"
      },
      {
        "name": "Saranjeet Kaur Bhogal",
        "url": "https://github.com/SaranjeetKaur"
      }
    ],
    "date": "2024-11-23",
    "categories": [
      "Research Software Engineering",
      "Open Science",
      "Coding"
    ],
    "contents": "\nOpen Source PublishingAre you ready to get some credit for the coding you’ve been doing as part of your research?\nThis episode will focus on ways to make your code contribute to your resumé. We will look at how you can share your code with the world (including various software licensing options), get persistent identifiers and make your code citable, and even how you can publish your code as an article!\n12 December 2024 @ 8:30 - 10:00 am UTC see in your local time\nRegister now\nOur Speakers\nAdeyinka Oresanya,\nSoftware Developer, Community Health Analytics in Open Source Software (CHAOSS)\nAdeyinka Oresanya is a multidisciplinary software developer and open-source maintainer\nwith a strong foundation in research. She holds a PhD in Agricultural Extension and Rural\nDevelopment, combining a unique blend of academic rigour and practical software\nengineering skills to lead impactful projects. As the Badging Lead for the DEI Event\nBadging Program at CHAOSS, she plays a key role in advancing diversity, equity, and\ninclusion within open-source communities and events. Adeyinka also leads the CHAOSS Africa\nDevelopers’ Focus Group, where she drives initiatives aimed at fostering the growth of\nopen-source developer communities across Africa.\nChioma Onyido,\nBioinformatics Engineer, Bioconductor & Covenant University\nChioma is a seasoned biocurator and bioinformatician with a background in biochemistry, who transitioned into Bioinformatics to explore how computational tools and data science can solve real-world health challenges. Her work spans using Bioconductor and open-source tools to analyze complex biological datasets and develop predictive models, aiming to improve disease risk prediction for underrepresented populations. She enjoys making research more accessible by creating well-documented, reproducible code and sharing bioinformatics resources with the community.\nEmail: chiomabonyido @ gmail dot com\nDr Kate Huddlestone,\nSenior Lecturer, Department of General Linguistics, Stellenbosch University, South Africa\nI am a senior lecturer in the Department of General Linguistics at Stellenbosch University, the managing editor for Stellenbosch Papers in Linguistics Plus (SPiL Plus) and deputy chairperson for the Southern African Linguistics and Applied Linguistics Society (SALALS). My research focuses primarily on South African Sign Language (SASL) but I also work on aspects of the syntax and pragmatics of Afrikaans and South African English. I use ELAN to annotate SASL data collected from deaf signers. I use R to analyse the effect of linguistic and sociolinguistic variables on lexical variation, language structure and language use.\nEmail: katevg @ sun dot ac dot za\nJuan Pablo Flores,\nSenior Program Manager, GitHub\nJuan Pablo Flores is a Program Manager at GitHub, where he supports the creation of\nopportunities for people from diverse backgrounds to learn programming and fosters connections among different technical communities. He has worked on research in Human-Computer Interaction (HCI), focusing on how individuals collaborate on online platforms, and has explored the social dynamics of live streaming. His recent work includes advancing Open Science initiatives and measuring the impact of artificial intelligence in education, with the goal of leveraging technology for more inclusive and effective learning environments.\nEmail: juanpflores @ github dot com\nMars Lee,\nTechnical Illustrator, NumPy & Open Source Design\nMars Lee is a Technical Illustrator that makes byte-sized comics that explain technical topics! She uses art, an under-represented skillset in open source, to get scientists contributing. From contributing back to libraries they use, she hopes scientists share their own research code and software. She is active in the Scientific Python space, with contributions to NumPy, JupyterLab, scikit-learn and more. Her most recent works are the ‘How to Contribute to NumPy’ comics - https://heyzine.com/flip-book/3e66a13901.html\nX: https://x.com/marsbarlee\nResources\nA useful open educational resource related to these topics are available from CodeRefinery.\nFollow the CodeRefinery lesson on Social Coding and Open Software\nStay Connected\nFollow our LinkedIn page to get the latest updates about this series\n\n\n\n",
    "preview": "events/2024-12-12_Ep-3-Open-Research-Code/publishing_CC.png",
    "last_modified": "2024-11-24T00:05:32+00:00",
    "input_file": {},
    "preview_width": 520,
    "preview_height": 292
  }
]
