[
  {
    "path": "blog/2022-10-01-RSEAAExp22/",
    "title": "My experiece note of RSE Asia Australia Unconference 2022",
    "description": "This is my experience note about RSE Asia Australia (RSEAA) Unconference 2022. RSEAA was held at Zoom Events from September 14 to 16.",
    "author": [
      {
        "name": "Kozo Nishida",
        "url": "https://github.com/kozo2"
      }
    ],
    "date": "2022-10-18",
    "categories": [
      "Research Software Engineering",
      "Community Building",
      "Unconference",
      "Experience Blog"
    ],
    "contents": "\r\n\r\n\r\n\r\n\r\n\r\nWhat is the RSEAA Unconference?\r\nAn unconference is a conference where all participants engage in oactive discussion rather than just listening to the speaker’s talk.\r\nThe RSEAA unconference had a mixed style of regular conference and unconference.\r\nThe regular style part had three keynote and a panel discussion.\r\nRecordings of the keynotes and panel discussion are available on YouTube.\r\n\r\n\r\n\r\n\r\n\r\n\r\nIn addition, it should be noted that the summary report is published at DOI (figshare) below.\r\n(It’s great, so please take a look.)\r\nMosbergen, Rowland (2022): Research Software Engineer Asia Australia Unconference Summary Report. figshare. Online resource. https://doi.org/10.6084/m9.figshare.21201989.v2\r\nThoughts on the keynotes\r\nRSEAA had three keynotes.\r\nI watched the Mars and Anne keynotes live.\r\n(I was unable to watch Jess’s keynote live.)\r\nHere are my thoughts on Mars and Anne’s keynote.\r\nMars Lee\r\nMars is a technical illustrator at Quansight.\r\nMars has a slightly different career path for RSE, and she introduced it in the keynote.\r\nI think Mars’ talk was a great talk that helped improve inclusivity of the RSE community.\r\nYou can check the slides in this GitHub repo.\r\n\r\n\r\nAnne Steele\r\nAnne is a community manager of the Turing Way.\r\nAnne’s talk covered her career history, what she’s learned through her career and the projects she’s working on.\r\nAnne introduced the objectives of equality, diversity and inclusion in improving reproducibility and openness of research.\r\nIn Japan, where I live, there is no Community Manager for Open Science like Anne.\r\nSo it was an exciting opportunity for me.\r\n\r\n\r\nAbout the part of “Unconference”\r\nThe parts other than the keynote were held in an “Unconference” format.\r\nHere are the themes of the discussion that took place there.\r\nWithin the RSEAA Zoom Event, we were able to enter and leave rooms that were divided into different themes for the unconference.Computational Reproducibility\r\nQuantify RSE outputs\r\nBenchmarking domain-specific research workflow solutions at an international level\r\nHosting research software\r\n#BridgingTheGap between #Biologists and #Programmers\r\nWhat exactly does the most senior RSE look like?\r\nQuestions to ask your supervisor at your RSE performance review\r\nWhat would a secure RSE position look like?\r\nLet’s discuss employment realities, as a student, as a grad, as a postgrad, as an ECR\r\nRSE Silos\r\nSoftware as first-class outputs\r\nJustifying maintenance work\r\nA Web Platform for RSEs\r\nActionable Items1 - Community Building\r\nActionable Items2 - Peer programming and collaboration\r\nWhat are your thoughts on each of the above themes?\r\nProbably all of them are exactly what you(==RSE) want to discuss with someone.\r\nI was very impressed to learn that there are places (communities) in the world where people can discuss these themes.\r\n“Impressions about the RSEAA accessibility” and “a call for non-English-speaking RSEs participation”\r\nRSEAA had a great attention to accessibility.\r\nI am Japanese and I am not good at English.\r\nHowever, RSEAA had Zoom’s Live Transcription feature, so I had no trouble listening to English.\r\nMany Japanese can read English, but cannot listen or speak.\r\nRSEAA is well prepared on accessibility and Liz Hare has provided a high level accessibility report for the conference.\r\nIf you’re avoiding joining the RSE community because you’re not good at English, don’t be afraid.\r\nThe RSE community is a community that cares about inclusiveness.\r\nPlease feel free to join to the RSE community!\r\nFurther information about RSE and my gratitude for RSEAA organizaers\r\nIf you are interested in the RSE community, please take a look at International RSE Survey 2022.\r\nIt was just released during this RSEAA.\r\nI think that looking at the survey results will help us understand the current situation and think about the future.\r\nFinally, I would like to thank all the organizers for running RSEAA.\r\n\r\n\r\n\r\n",
    "preview": "blog/2022-10-01-RSEAAExp22/preview.png",
    "last_modified": "2022-10-31T19:18:33+09:00",
    "input_file": "RSEAAExp22.knit.md",
    "preview_width": 1183,
    "preview_height": 332
  },
  {
    "path": "blog/2022-10-07-OLS5Exp22/",
    "title": "Place your title here",
    "description": "Give a short description here about what this blog is about",
    "author": [
      {
        "name": "Jyoti Bhogal",
        "url": "https://jyoti-bhogal.github.io/about-me/"
      }
    ],
    "date": "2022-10-07",
    "categories": [
      "Research Software Engineering",
      "Community Building",
      "Open Life Science",
      "Open Science",
      "Experience Blog"
    ],
    "contents": "\r\nClick below for the slide.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "blog/2022-10-07-OLS5Exp22/preview.png",
    "last_modified": "2022-10-06T15:47:41+05:30",
    "input_file": {},
    "preview_width": 137,
    "preview_height": 71
  }
]