[
  {
    "path": "blog/2024-10-30-EOSTRC_ep_1/",
    "title": "Enabling Open Science Through Research Code: Insights from Episode 1 - Conversations with Researchers Who Code ",
    "description": "This is a blog sharing insights from Episode 1 of the Community Conversation series 'Enabling Open Science Through Research Code'.",
    "author": [
      {
        "name": "Jyoti Bhogal, Mireille Grobbelaar, Anelda van der Walt, Saranjeet Kaur Bhogal",
        "url": "https://github.com/jyoti-bhogal"
      }
    ],
    "date": "2024-10-29",
    "categories": [
      "Research Software Engineering",
      "Open Science",
      "Coding",
      "Community Building",
      "Experience Blog"
    ],
    "contents": "\nEpisode 1 bannerOn October 10, 2024, the first episode of the ‘Enabling Open Science Through Research Code’ community conversation took place. The topic for the first episode was ‘Conversations with Researchers Who Code’ focusing on the pivotal role of research software in enabling open science. The event was hosted by RSSE Africa and the RSE Asia Association. It aimed to bring together researchers from various disciplines to share their experiences of coding, collaboration, and the challenges they face as they navigate the world of open science. This episode was a part of the celebration for International Research Software Engineer (RSE) Day, bringing attention to the growing importance of RSEs in research.\nSession Overview\nThe session kicked off with facilitators Anelda van der Walt and Saranjeet Kaur welcoming participants and introducing the co-facilitators Jyoti Bhogal and Mireille Grobbelaar. This diverse team set the stage for a lively discussion with four distinguished speakers: Dr. Biandri Joubert, Dr. Gaurav Bhalerao, Mahmoud Abdelrazek, and Prasad Sutar. The session had around 30 participants from all across the world.\nIntroductions & Open Science Insights\nAfter a warm welcome, the conversation shifted to the core topic: open science and the importance of research software and systems as described in the UNESCO Open Science Recommendations. The facilitators invited the speakers to share their academic backgrounds, work experiences, and current roles, giving the audience a sense of the various pathways that lead them into the world of research software coding.\nSome of the key questions posed to the speakers included:\nWhat did you study, and where?\nDo you have postgraduate qualifications?\nWhat is your current role, and how does coding feature in your work?\nThis introduction provided a backdrop to understand how the speakers’ careers evolved, and how their coding skills were developed to support their research or that of others at the organisation where they work.\nPanel Discussion: The Life of a Researcher Who Codes\nThe heart of the session was a panel discussion where the speakers delved deeper into the realities of research coding. Some highlights from the discussion include:\nDr. Gaurav Bhalerao explained how coding forms an integral part of his day-to-day activities, particularly in structuring large datasets for neuroscience research. He also shared the challenges of balancing coding with research responsibilities.\nMahmoud Abdelrazek talked about his work in geospatial analysis and how his team collaborates on coding projects. He highlighted the collaborative nature of his work, where coding is not only a personal skill but also a shared responsibility within his research group.\nDr. Biandri Joubert touched on the challenges of being the sole programmer in her group and how she overcomes the feeling of isolation by participating in coding communities and seeking support from platforms like the Carpentries.\nPrasad Sutar discussed his experience with developing software that is used by others and the importance of ensuring that his coding practices align with both the research objectives and software quality standards.\nThe panel also explored whether all researchers should learn to code. They agreed that even if a researcher doesn’t need to code regularly, learning basic coding concepts is valuable. This foundational knowledge enables researchers to read and understand code at a high level, helping them grasp the algorithms or logic applied to address specific problem statements. A valuable analogy, comparing coding to medical training was suggested during the meetup. Just as it’s beneficial for everyone to learn basic first-aid, it’s useful for researchers to grasp fundamental coding concepts. Some may advance to become paramedics, equivalent to those using coding more regularly, while a few specialize deeply - similar to neurosurgeons or expert programmers. What are your thoughts? Should coding become a core skill for all researchers, or is it more practical to foster collaboration with coding specialists when needed?\nThe panel also explored topics like the amount of time spent coding, the collaborative nature of research software projects, and the availability of support and training for researchers.\nLearning and Community Support\nAn essential part of the discussion revolved around the resources and communities that help researchers improve their coding skills. Dr. Gaurav Bhalerao recommended resources such as Carpentries lessons and online coding tutorials like p5.js for those starting out. The speakers emphasized the importance of continuous learning and staying connected with the global community through platforms like RLadies, Quarto, and others. To know about more resources please see the section Resources and Links.\nQ&A and Wrap-Up\nThe session concluded with a Q&A where participants posed questions about the pain points of learning to code, transitioning into a coding role from other fields, and how to stay updated with coding trends while maintaining research quality. One insightful comment came from Dr. Biandri Joubert, who emphasized that code that runs doesn’t always mean it’s correct, highlighting the critical need for combining coding skills with sound statistical knowledge.\nThe facilitators wrapped up the event by sharing resources from partners, including RSSE Africa, RSE Asia, AREN, and ReSA, all of which provide platforms for collaboration, learning, and advocacy for the Research Software Engineering community.\nResources and Links\nTo access the wealth of resources shared in the session, visit our collection at Zenodo.\nFor those who missed this enlightening conversation, a recording of Episode 1 is available on the RSSE Africa website. Please remember to register for Episode 2 of the series. The conversation continues, highlighting the essential role of research software engineering in advancing open science globally.\nLearn More About Us\nFor more information and to join upcoming events, visit:\nRSSE Africa\nWebsite: https://rsse.africa\nSign up for our newsletter: https://talarify.us14.list-manage.com/subscribe?u=35d5db26d3b108b9ef9b9ac43&id=55e9f5a692\nJoin our LinkedIn group, where you can also share information with the broader community: https://www.linkedin.com/groups/12903402/\nRSE Asia\nWebsite: https://rse-asia.github.io/RSE_Asia/\nFor the latest news, events, activities, and opportunities, follow us on our LinkedIn page (https://www.linkedin.com/company/rse-asia-association/)\nTo join the RSE Asia community, please fill out our short Community Membership Form (https://docs.google.com/forms/d/1XSxDaTJzcNyGeDYXyJNVg1TDCo7un18PLFNiK6\\_jL2g/edit)\nAREN\nWebsite: https://africanrn.org/\nSign up: https://docs.google.com/forms/d/e/1FAIpQLSeeFkD5A4D9l6ncQWjKBiI-GqBOzL-JMe7Fx3ijUYEjHjDUoQ/viewform\nReSA\nWebsite: https://www.researchsoft.org/\nSign up for the newsletter: https://www.researchsoft.org/news/\nThe Amsterdam Declaration on Funding Research Software Sustainability\nBecome a signatory: https://adore.software/sign/\n\n",
    "preview": "blog/2024-10-30-EOSTRC_ep_1/rse-meetup-series_landscape_cover.png",
    "last_modified": "2024-11-23T23:12:59+00:00",
    "input_file": {},
    "preview_width": 2000,
    "preview_height": 1125
  },
  {
    "path": "blog/2022-10-01-RSEAAExp22/",
    "title": "My experiece note of RSE Asia Australia Unconference 2022",
    "description": "This is my experience note about RSE Asia Australia (RSEAA) Unconference 2022. RSEAA was held at Zoom Events from September 14 to 16.",
    "author": [
      {
        "name": "Kozo Nishida",
        "url": "https://github.com/kozo2"
      }
    ],
    "date": "2022-10-18",
    "categories": [
      "Research Software Engineering",
      "Community Building",
      "Unconference",
      "Experience Blog"
    ],
    "contents": "\r\n\r\n\r\n\r\n\r\n\r\nWhat is the RSEAA Unconference?\r\nAn unconference is a conference where all participants engage in oactive discussion rather than just listening to the speaker’s talk.\r\nThe RSEAA unconference had a mixed style of regular conference and unconference.\r\nThe regular style part had three keynote and a panel discussion.\r\nRecordings of the keynotes and panel discussion are available on YouTube.\r\n\r\n\r\n\r\n\r\n\r\n\r\nIn addition, it should be noted that the summary report is published at DOI (figshare) below.\r\n(It’s great, so please take a look.)\r\nMosbergen, Rowland (2022): Research Software Engineer Asia Australia Unconference Summary Report. figshare. Online resource. https://doi.org/10.6084/m9.figshare.21201989.v2\r\nThoughts on the keynotes\r\nRSEAA had three keynotes.\r\nI watched the Mars and Anne keynotes live.\r\n(I was unable to watch Jess’s keynote live.)\r\nHere are my thoughts on Mars and Anne’s keynote.\r\nMars Lee\r\nMars is a technical illustrator at Quansight.\r\nMars has a slightly different career path for RSE, and she introduced it in the keynote.\r\nI think Mars’ talk was a great talk that helped improve inclusivity of the RSE community.\r\nYou can check the slides in this GitHub repo.\r\n\r\n\r\nAnne Steele\r\nAnne is a community manager of the Turing Way.\r\nAnne’s talk covered her career history, what she’s learned through her career and the projects she’s working on.\r\nAnne introduced the objectives of equality, diversity and inclusion in improving reproducibility and openness of research.\r\nIn Japan, where I live, there is no Community Manager for Open Science like Anne.\r\nSo it was an exciting opportunity for me.\r\n\r\n\r\nAbout the part of “Unconference”\r\nThe parts other than the keynote were held in an “Unconference” format.\r\nHere are the themes of the discussion that took place there.\r\nWithin the RSEAA Zoom Event, we were able to enter and leave rooms that were divided into different themes for the unconference.Computational Reproducibility\r\nQuantify RSE outputs\r\nBenchmarking domain-specific research workflow solutions at an international level\r\nHosting research software\r\n#BridgingTheGap between #Biologists and #Programmers\r\nWhat exactly does the most senior RSE look like?\r\nQuestions to ask your supervisor at your RSE performance review\r\nWhat would a secure RSE position look like?\r\nLet’s discuss employment realities, as a student, as a grad, as a postgrad, as an ECR\r\nRSE Silos\r\nSoftware as first-class outputs\r\nJustifying maintenance work\r\nA Web Platform for RSEs\r\nActionable Items1 - Community Building\r\nActionable Items2 - Peer programming and collaboration\r\nWhat are your thoughts on each of the above themes?\r\nProbably all of them are exactly what you(==RSE) want to discuss with someone.\r\nI was very impressed to learn that there are places (communities) in the world where people can discuss these themes.\r\n“Impressions about the RSEAA accessibility” and “a call for non-English-speaking RSEs participation”\r\nRSEAA had a great attention to accessibility.\r\nI am Japanese and I am not good at English.\r\nHowever, RSEAA had Zoom’s Live Transcription feature, so I had no trouble listening to English.\r\nMany Japanese can read English, but cannot listen or speak.\r\nRSEAA is well prepared on accessibility and Liz Hare has provided a high level accessibility report for the conference.\r\nIf you’re avoiding joining the RSE community because you’re not good at English, don’t be afraid.\r\nThe RSE community is a community that cares about inclusiveness.\r\nPlease feel free to join to the RSE community!\r\nFurther information about RSE and my gratitude for RSEAA organizaers\r\nIf you are interested in the RSE community, please take a look at International RSE Survey 2022.\r\nIt was just released during this RSEAA.\r\nI think that looking at the survey results will help us understand the current situation and think about the future.\r\nFinally, I would like to thank all the organizers for running RSEAA.\r\n\r\n\r\n\r\n",
    "preview": "blog/2022-10-01-RSEAAExp22/preview.png",
    "last_modified": "2024-11-23T23:12:59+00:00",
    "input_file": {},
    "preview_width": 1183,
    "preview_height": 332
  },
  {
    "path": "blog/2022-10-01-RSEAAExp22-ja/",
    "title": "RSE Asia Australia Unconference 2022 体験レポート",
    "description": "これは、アジアオーストラリア地域で初めての\nRSE [Research Software Engineer の略] のカンファレンス (以降 RSEAA)\nの体験レポートです。\nRSEAA は、2022 年 9 月 14 ～ 16 日に Zoom Events で開催されました。",
    "author": [
      {
        "name": "西田 孝三",
        "url": "https://github.com/kozo2"
      }
    ],
    "date": "2022-10-07",
    "categories": [
      "Research Software Engineering",
      "Community Building",
      "Unconference",
      "Experience Blog"
    ],
    "contents": "\n\n\n\n\n\nRSE のアンカンファレンスとは何か\nRSE は Research Software Engineer の略称です。\nRSEの定義を知るにはこのリンクを参照してください。\nアンカンファレンス とは参加者同士が主体的に議論するスタイルのカンファレンスのことです。\nRSEAA のアンカンファレンスは、\n通常のカンファレンスのようなキーノートスピーカー+パネルディスカッションと、\nアンカンファレンスがミックスされたスタイルで開催されました。\nキーノートスピーカーとパネルディスカッションについては録画物をYouTubeで見ることができます。\n\n\n\n\n\n\nキーノートスピーチに関する感想\nRSEAA には3人のキーノートスピーチがありました。\n私は Mars と Anne のスピーチをライブで聴講しました。\n私は Jess のスピーチは仕事の都合でライブで聞くことはできませんでした。\nここでは Mars と Anne のキーノートに関する感想を述べます。\nMars Lee\nMars は Quansight のテクニカルイラストレーターです。\nMars は RSE としては少し変わったキャリアパスの持ち主であり、彼女はそれをこのキーノートスピーチで紹介していました。\nMars のトークは、RSEコミュニティの包括性の向上に役立つすばらしいトークだったと思います。\nMars のスライドは、この GitHub リンク\nにあります。\n\n\nAnne Steele\nAnne は The Turing Way のコミュニティマネージャーです。\nAnne のトークは彼女のキャリアの歴史、彼女が学んできたこと、そして今関わっているプロジェクトを紹介するものでした。\nAnne は主に The Turing Way を通して再現性の改善や研究のオープン化において、平等、多様性、包括性といった目的をどのように実現しようとしているかを説明していました。\n日本では Anne のようなオープンサイエンスコミュニティのためのコミュニティマネージャーはいません。\nそのため、それは貴重な機会でした。\n\n\nストラテジーとポリシーのパネルディスカッションとアンカンファレンスについて\nキーノート以外のパートはアンカンファレンス形式で行われました。\nここではそこで行われた議論のテーマを箇条書きします。\nZoom Events 内では、アンカンファレンスのテーマ毎に分かれた部屋を選択して入退出できました計算の再現性について (Computational Reproducibility)\nRSE の成果の定量化について (Quantify RSE outputs)\n国際レベルでのドメイン固有の研究ワークフローソリューションのベンチマーク (Benchmarking domain-specific research workflow solutions at an international level)\n研究ソフトウェアのホスティングについて (Hosting research software)\nBiologists と Programmers のギャップを埋めることについて (#BridgingTheGap between #Biologists and #Programmers)\n最上級の RSE とは正確にはどのようなものか? (What exactly does the most senior RSE look like?)\nRSE のパフォーマンスのレビューで上司に尋ねる質問 (Questions to ask your supervisor at your RSE performance review)\n安全な RSE ポジションとはどのようなものか? (What would a secure RSE position look like?)\n学生として、卒業生として、大学院生として、ECR [注: Early Career Researcher] として、雇用の現実について話し合おう (Let’s discuss employment realities, as a student, as a grad, as a postgrad, as an ECR)\nRSE の複数のサイロについて [注: サイロとはアプリやシステムが孤立し情報が連携されていないことを言います] (RSE Silos)\n一流のアウトプットとしてのソフトウェアについて (Software as first-class outputs)\n保守作業を正当化することについて [注: 研究ソフトウェア業界では保守に対する評価はされません] (Justifying maintenance work)\nRSE 達のためのウェブプラットフォームについて (A Web Platform for RSEs)\n実行可能なアイテム1 - コミュニティの構築 (Actionable Items1 - Community Building)\n実行可能なアイテム2 - Peer programming [注: 何らかの環境を複数人で共有してプログラミングすること] とコラボレーション (Actionable Items2 - Peer programming and collaboration)\n上記の各テーマを見て、あなたはどう思われましたか？\nおそらくどれも普段疑問に感じている、しかし身近に相談する人がいない、と思うことではないでしょうか？\nそれはまさに私も同じであり、このアンカンファレンスに参加して\n「こういったテーマを議論できる場(コミュニティ)が世界には存在するのだ」ということを知り、感銘を受けました。\nアクセシビリティに関する印象と、非英語圏の RSE 達への参加の呼びかけ\nRSEAA はアクセシビリティに対する配慮が優れていました。\n私は日本人であり英語が得意ではありません。\nですが RSEAA では Zoom の live transcription 機能が有効化されており、英語を聞きとることについては不自由がありませんでした。\n日本人の多くはリーディングはできますが、リスニングとスピーキングができません。\nRSEAA がアクセシビリティに関して準備した内容の詳細はこのリンクを参照してください。\nもしあなたが英語が苦手だからという理由で RSE コミュニティへの参加を避けているのであれば、恐れを感じる必要はありません。\nRSE コミュニティは包括性に対する配慮をしてくれるコミュニティです。\nぜひ安心して参加してみてください。\nRSEAA の先とオーガナイザーへの感謝\nここまで読んでいただいて RSE コミュニティに興味を持っていただいた方は\nInternational RSE Survey 2022\nをぜひご覧ください。\nそれはこの RSEAA の期間中に公開されたばかりです。\nそのサーベイ結果を見ることは現状把握と今後を考えるのに役立つと思います。\n最後に、RSEAA を運営してくださった主催者の皆様に感謝いたします。\n\n\n\n",
    "preview": "blog/2022-10-01-RSEAAExp22-ja/preview.png",
    "last_modified": "2024-11-23T23:12:59+00:00",
    "input_file": {},
    "preview_width": 1183,
    "preview_height": 332
  },
  {
    "path": "blog/2022-10-07-OLS5Exp22/",
    "title": "My Experience of Participating in Open Life Science Cohort-5",
    "description": "During March to July 2022, I got the opportunity to participate in Open Life Science Cohort-5. In this duration, I worked on my project for enhancing the community of RSE Asia Association.",
    "author": [
      {
        "name": "Jyoti Bhogal",
        "url": "https://jyoti-bhogal.github.io/about-me/"
      }
    ],
    "date": "2022-10-07",
    "categories": [
      "Research Software Engineering",
      "Community Building",
      "Open Life Science",
      "Open Science",
      "Experience Blog"
    ],
    "contents": "\r\nClick below for the slide.\r\nhttps://docs.google.com/presentation/d/1aYyBzvDkGMRzl1pMt0RJ4de772t-SwzGyXgmMkHrUWY/edit#slide=id.p\r\n\r\n\r\n\r\n\r\n\r\nProject Title and Motivation\r\nIn the OLS-5 cohort, I got the opportunity to work on my project titled ‘Building Pathways for Onboarding to Research Software Engineering (RSE) Asia Association and Adoption of Code of Conduct’. My mentor for the program was Malvika Sharan. There are several incidents when people want to contribute in a community activity, but the community does not have a well-defined path that will help a new person contribute. This motivated me to work on building pathways for new members to join the RSE Asia Association.\r\nThe Backstory\r\nThe inception of RSE Asia Association goes back to September 2021, when our idea of starting it got the support of the experts from the OLS-4 cohort. Back then we started off with a basic logo. We had set up the entire digital structure need to run the community. During cohort 5, we updated the logo.\r\nMilestones the RSE Asia Association Crossed During OLS-5\r\nLet’s have a look at the milestones in the journey that RSE Asia Association went through while OLS-5.\r\nMilestone 1\r\nThe selection into OLS-5 itself was a milestone. Following which, we started discussions around how to get our Association registered.\r\nWe wanted to register ourselves as an NGO. With the guidance from my mentor Malvika, I read several articles. I found out about the different types of NGOs that function here in India. After careful reading, understanding and discussions with my mentor, we finalized which type of NGO would be best for us to register as. At the moment, the registration is a work in progress.\r\nMilestone 2\r\nWhen it comes to community work, we had identified that a lot of people are enthusiastic about participating in community work, however many communities face an issue when it comes to a smooth process for people to join them. Hence, we decided to define clear pathways for people to join us, to contribute/learn for a specific time duration.\r\nMilestone 3\r\nThe RSE Asia Association also got listed as an ‘Observer Association’ at the International Council of RSE Associations.\r\nMilestone 4\r\nOn 8th July 2022, we conducted a workshop, where Isabela Presedo-Floyd and Mars Lee very graciously accepted our invitation to share their knowledge of how alt-texts are written. It was indeed a very exciting and engaging event where people did hands-on work!\r\nNext steps\r\nJyoti would continue with the formalities of getting the association registered legally. Saranjeet and Jyoti are planning to conduct more and more exciting events and workshops.\r\nStaying connected\r\nCome have a look at our activities!\r\nWe are absolutely active on Twitter. We send out all our updates, reminders and links to various forms via our twitter handle which is @RSE_Asia. Do check out our twitter page, look at our past and upcoming events, DM us to speak your thoughts!\r\nSpecial mentions and acknowledgements\r\nWe feel very grateful to the OLS team for giving us this chance to grow our RSE Asia Association!\r\nWe are extremely thankful to be a part of such a wonderful and supportive community that OLS is!\r\nAnd our contact details are shown herewith. You can get in touch with us via our twitter handle, our email address.\r\nYou can also visit our website, YouTube channel or our GitHub page.\r\nThank you!!!\r\n\r\n\r\n\r\n",
    "preview": "blog/2022-10-07-OLS5Exp22/preview.png",
    "last_modified": "2023-01-31T07:30:18+00:00",
    "input_file": {},
    "preview_width": 137,
    "preview_height": 71
  }
]
